benchmark-results/reference-balancer/uniform-least_conn.txt
Summary:
  Success rate:	100.00%
  Total:	30013.6258 ms
  Slowest:	28.1371 ms
  Fastest:	0.3067 ms
  Average:	7.0561 ms
  Requests/sec:	28308.5758

  Total data:	2.43 MiB
  Size/request:	3 B
  Size/sec:	82.92 KiB

Response time histogram:
   0.307 ms [1]      |
   3.090 ms [19695]  |■
   5.873 ms [268322] |■■■■■■■■■■■■■■■■■■■■■■■
   8.656 ms [367259] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  11.439 ms [152269] |■■■■■■■■■■■■■
  14.222 ms [35122]  |■■■
  17.005 ms [5832]   |
  19.788 ms [842]    |
  22.571 ms [102]    |
  25.354 ms [5]      |
  28.137 ms [5]      |

Response time distribution:
  10.00% in 4.2197 ms
  25.00% in 5.3462 ms
  50.00% in 6.7841 ms
  75.00% in 8.4727 ms
  90.00% in 10.2367 ms
  95.00% in 11.4172 ms
  99.00% in 13.9056 ms
  99.90% in 17.1638 ms
  99.99% in 20.1260 ms


Details (average, fastest, slowest):
  DNS+dialup:	0.9712 ms, 0.0917 ms, 5.6245 ms
  DNS-lookup:	0.0114 ms, 0.0028 ms, 0.5445 ms

Status code distribution:
  [200] 849454 responses

Error distribution:
  [189] aborted due to deadline